w6d5/cats_project/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "The greatest cat!"], ["updated_at", "2021-01-02 11:16:47.484983"], ["id", 3]]
---
  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update(cat_params)