w8d1/RedditClone/app/controllers/application_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def require_moderator
        sub = Sub.find_by(id: params[:id])