w8d1/RedditClone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "dsaf"], ["url", "afsaf"], ["content", "adsfsa"], ["author_id", 3], ["created_at", "2021-01-11 22:33:26.080162"], ["updated_at", "2021-01-11 22:33:26.080162"]]
INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 2], ["sub_id", 1], ["created_at", "2021-01-11 22:36:50.620543"], ["updated_at", "2021-01-11 22:36:50.620543"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save
      params[:post][:sub_ids].each do |sub_id|
        PostSub.create!(post_id: @post.id, sub_id: sub_id)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @post = current_user.posts.find_by(id: params[:id])

UPDATE "posts" SET "url" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["url", "changed"], ["updated_at", "2021-01-11 22:49:38.949784"], ["id", 4]]
---
  def update
    @post = current_user.posts.find_by(id: params[:id])
    if @post && @post.update(post_params)