w8d1/RedditClone/app/controllers/subs_controller.rb

  def update
    @sub = current_user.subs.find_by(id: params[:id])

    if @sub && @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "Check edit "], ["description", "testing for edit checkked"], ["updated_at", "2021-01-11 19:17:18.946047"], ["id", 2]]