w8d1/RedditClone/app/views/posts/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    <li><%= @post.content %></li>
    <li><%= User.find_by(id: @post.author_id).username %></li>