w7d2/MusicApp/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "zFXG2_rQJASnDKr8qRIa1Q"], ["LIMIT", 1]]
---
  def current_user
    return nil unless session[:session_token]
    User.find_by(session_token: session[:session_token])