w6d2/Art_Share_API/app/controllers/artworks_controller.rb

    def index
        # if params.has_key?(:user_id)
            owned = Artwork.where(artist_id: params[:user_id])
        # elsif params.has_key?(:artist_id)
            shared = Artwork.joins(:shares).where(artworkshares: {viewer_id: params[:user_id]})
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
SELECT "artworks".* FROM "artworks" INNER JOIN "artworkshares" ON "artworkshares"."artwork_id" = "artworks"."id" WHERE "artworkshares"."viewer_id" = $1  [["viewer_id", "1"]]