w6d2/Art_Share_API/app/controllers/users_controller.rb

    def index
        debugger
        if request.query_string.present?
            query = request.query_string.split('=').last

            user = User.where(username: query)
            render json: user
        else
             render json: User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "Trevor"]]
SELECT "users".* FROM "users"

    def update
        debugger
        user = User.find(params[:id])

        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Trevor"], ["updated_at", "2020-12-31 00:42:17.164790"], ["id", 7]]