w6d5/cats_project/app/models/cat_rental_request.rb

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2021-01-03 04:15:27.448385"], ["id", 1]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2021-01-10' OR end_date < '2021-01-04') AND (status = 'PENDING')  [["id", 1], ["cat_id", 7]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2021-01-03 04:15:27.452143"], ["id", 2]]
---
  def approve!
    raise 'not pending' unless self.status == 'PENDING'

    transaction do
      self.status = 'APPROVED'
      self.save!

      overlapping_pending_requests.each do |request|
        request.update!(status: 'DENIED')

SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2021-01-10' OR end_date < '2021-01-04') AND (status = 'APPROVED') LIMIT $3  [["id", 1], ["cat_id", 7], ["LIMIT", 1]]
---
  def does_not_overlap_approved_request
    return if self.denied?

    unless overlapping_approved_requests.empty?