w6d5/cats_project/app/models/cat_rental_request.rb

  def does_not_overlap_approved_request
    return if self.denied?

    unless overlapping_approved_requests.empty?
---
SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" IS NOT NULL AND "cat_rental_requests"."cat_id" = $1 AND NOT (start_date > '2021-01-10' OR end_date < '2021-01-04') AND (status = 'APPROVED') LIMIT $2  [["cat_id", 7], ["LIMIT", 1]]